In [1]:
import pandas as pd

In [2]:
score_data = pd.read_csv('data/score.csv', encoding='euc-kr', index_col='과목')
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

### 수업시작

#### 정렬
- index 및 컬럼명 기준 정렬 : sort_index()
- 값 기준 정렬 : sort_values()

In [3]:
score_data.T

과목  수학  영어  국어  사회  과학
1반  45  76  47  92  11
2반  44  92  92  81  79
3반  73  45  45  85  47
4반  39  69  69  40  26

In [4]:
# index 기준 정렬 # ㄱ먼저
score_data.sort_index()

    1반  2반  3반  4반
과목
과학  11  79  47  26
국어  47  92  45  69
사회  92  81  85  40
수학  45  44  73  39
영어  76  92  45  69

In [5]:
#내림차순
score_data.sort_index(ascending=False)

    1반  2반  3반  4반
과목
영어  76  92  45  69
수학  45  44  73  39
사회  92  81  85  40
국어  47  92  45  69
과학  11  79  47  26

In [6]:
#컬럼명 기준 정렬
score_data.sort_index(axis=1,ascending=False)

    4반  3반  2반  1반
과목
수학  39  73  44  45
영어  69  45  92  76
국어  69  45  92  47
사회  40  85  81  92
과학  26  47  79  11

- value 기준 정렬

In [7]:
# DF의 컬럼이나 index가 여러개일 경우 그 기준을 설정해줘야 함
# 3반의 점수를 기준으로 행 방향(세로) 오름차순 정렬
score_data.sort_values(by='3반')

    1반  2반  3반  4반
과목
영어  76  92  45  69
국어  47  92  45  69
과학  11  79  47  26
수학  45  44  73  39
사회  92  81  85  40

In [8]:
score_data.sort_values(by='3반',ascending= False)

    1반  2반  3반  4반
과목
사회  92  81  85  40
수학  45  44  73  39
과학  11  79  47  26
영어  76  92  45  69
국어  47  92  45  69

In [9]:
score_data.sort_values(by='사회',axis = 1,ascending= False)

    1반  3반  2반  4반
과목
수학  45  73  44  39
영어  76  45  92  69
국어  47  45  92  69
사회  92  85  81  40
과학  11  47  79  26

#### 정리
- axis = 0 (행 방향)일 경우는 기준을 컬럼명으로 잡고
- axis = 1 (열 방향)일 경우는 기준을 인덱스로 잡음??

In [10]:
# 디폴트 값으로 오름차순         
# 3반 기준으로 정렬 후, 그 중 같은 값들은 1반 기준으로 한번 더 정렬
score_data.sort_values(by=['3반','1반'])

    1반  2반  3반  4반
과목
국어  47  92  45  69
영어  76  92  45  69
과학  11  79  47  26
수학  45  44  73  39
사회  92  81  85  40

#### sum()

In [11]:
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [12]:
score_data.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [13]:
score_data.sum(axis =1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

- 과목별 합계를 구하여 DF의 맨 우측에 '총합'컬럼을 추가해보세요~!

In [14]:
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [15]:
score_data['총합']=score_data.sum(axis=1)
score_data

    1반  2반  3반  4반   총합
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

#### mean()

- 각 과목들의 평균을 구하고 DF 우측에 '평균' 컬럼을 생성해보세요~!

In [16]:
score_data.drop('총합',axis=1,inplace=True)

In [17]:
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [18]:
score_data['총합']=score_data.sum(axis=1)
score_data

    1반  2반  3반  4반   총합
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [19]:
score_data = pd.read_csv('data/score.csv', encoding='euc-kr', index_col='과목')
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [20]:
score_data['총합']=score_data.sum(axis=1)
score_data['평균']=score_data.iloc[:,:4].mean(axis=1)
score_data

    1반  2반  3반  4반   총합     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

#### min(),max()

In [21]:
# 1반에서 가장 높은 점수
score_data['1반'].max()

92

In [22]:
score_data[:].max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
총합    298.0
평균     74.5
dtype: float64

In [23]:
score_data[:].max(axis=1)

과목
수학    201.0
영어    282.0
국어    253.0
사회    298.0
과학    163.0
dtype: float64

In [24]:
# 전체 반 중에서 가장 높은 수학 점수를 구해보자!
score_data.iloc[0,:4].max()

73.0

In [25]:
score_data.loc['수학',:'4반'].max()

73.0

- 전체 과목 점수 중에서 과목별로 가장 큰 값과 작은 값의 차이를 구해보세요~!

In [26]:
score_data

    1반  2반  3반  4반   총합     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [27]:
max_score = score_data.iloc[:,:4].max(axis=1)
min_score = score_data.iloc[:,:4].min(axis=1)
max_score - min_score

과목
수학    34
영어    47
국어    47
사회    52
과학    68
dtype: int64

In [28]:
max_score

과목
수학    73
영어    92
국어    92
사회    92
과학    79
dtype: int64

In [29]:
max_score = score_data.iloc[:,:'4반'].max()

TypeError: cannot do positional indexing on Index with these indexers [4반] of type str

#### Count()

In [ ]:
score_data.count()

#### info()
- DF에 대한 전체적인 정보를 출력

In [ ]:
score_data.info()

#### value_counts()
- 특정 컬럼에 있는 데이터들의 유니크 값과 그 개수를 출력

In [ ]:
df_test=pd.DataFrame([['집중','집중','집중','집중'],
                      ['집중','집중','집중','졸림'],
                      ['집중','집중','졸림','자냐?'],
                      ],
                        columns = ['1교시','2교시','3교시','4교시'])
df_test

In [ ]:
df_test = pd.DataFrame([['집중','집중','집중','집중'],
                        ['집중','집중','집중','졸림'],
                        ['집중','집중','졸림','자냐?'],
                       ],
                       columns=['1교시', '2교시', '3교시', '4교시']
                      )
df_test

In [ ]:
df_test['3교시'].value_counts()

In [ ]:
df_test['4교시'].value_counts()

#### apply()
- 사용자 정의 함수를 이용하여 행 또는 열에 복잡한 처리를 한 번에 해주는 함수

In [30]:
score_data.drop(['총합','평균'],axis=1,inplace=True)

In [31]:
score_data

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [32]:
score_data.max()

1반    92
2반    92
3반    85
4반    69
dtype: int64

In [33]:
# 최대값 , 최소값의 차이를 계산해주는 사용자 정의 함수
def calculate(x):
    return x.max() - x.min()

In [34]:
# DF 내 전체 데이터에서 각 과목의 최대점수와 최소점수의 차이를 구하는 로직을 만들어보자
score_data.apply(calculate, axis=1)

과목
수학    34
영어    47
국어    47
사회    52
과학    68
dtype: int64

- apply 함수에는 반드시 사용자 정의 함수가 포함되어야 함!

#### concat()
- Series나 DF을 병합할 때 사용

In [ ]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series(['female','female','male','male','female'])
s3=pd.Series([1,0,1,0,1])
s2

In [ ]:
pd.concat([s1,s2,s3]) # axis=0 이 디폴트 값(위에서 아래쪽으로 합쳐짐)

In [ ]:
ti = pd.concat([s1,s2,s3],axis=1)
ti.columns = ['PassengerId','Sex','Survived']
ti

#### groupby()
- 데이터를 그룹별로 묶어서 집계를 낼 수 있게 해주는 함수
- 엑셀의 피벗테이블 기능과 같음

In [ ]:
# Sex 값에 따른 Survived 값의 합계 구하기 == 성별에 따른 생존자 수 확인하기
ti[['Sex','Survived']].groupby('Sex').sum()

In [ ]:
# Sex, Survived 값 기준으로 PassengerId의 개수 세기
# == 성별을 기준으로 생존자 수와 사망자 수를 카운트
ti.groupby(['Sex','Survived']).count()

### Pandas 실습 예제!!
2015~2017년 광주광역시 범죄현황 데이터를 이용해 전년 대비 지역별 범죄 증감율을 구해보자!
- (증감률 공식 = (금년-작년)/작년*100)

#### 데이터 로드
- 인덱스 컬럼은 '관서명'으로 설정할 것
- 인코딩은 'euc-kr'로 설정할 것

In [ ]:
df_2015=pd.read_csv('data/2015.csv', encoding='euc-kr', index_col = '관서명')
df_2016=pd.read_csv('data/2016.csv', encoding='euc-kr', index_col = '관서명')
df_2017=pd.read_csv('data/2017.csv', encoding='euc-kr', index_col = '관서명')

In [ ]:
df_2015sum = df_2015.iloc[::6,1:].sum(axis=1)
df_2016sum = df_2016.iloc[::6,1:].sum(axis=1)
df_2017sum = df_2017.iloc[::6,1:].sum(axis=1)

del df_2017sum['광주지방경찰청']
ch1516=(df_2016sum-df_2015sum)/df_2015sum*100
ch1617=(df_2017sum-df_2016sum)/df_2016sum*100

crime_data = pd.concat([df_2015sum,ch1516,df_2016sum,ch1617,df_2017sum],axis=1)
crime_data.columns = ['2015총계','2015~16증감율','2016총계','2016~17증감율','2017총계']

crime_data

#### 데이터 가공
- 결과값과 다른 부분 확인하고 처리하기

#### 범죄 증감율 공식에 따르면 범죄발생횟수의 합이 필요하므로 총합 구하기

#### 데이터 자르기 : 구분 칼럼의 발생건수, 총계
- 년도별 Series들로 구성

#### 공식 사용하여 전년 대비 증감율 구하기

#### 4번의 년도별 Series들과 15~16년 증감율 16~17년 증감율 Series를 합치기

In [ ]:
df_2015sum = df_2015.iloc[::6,1:].sum(axis=1)
df_2016sum = df_2016.iloc[::6,1:].sum(axis=1)
df_2017sum = df_2017.iloc[::6,1:].sum(axis=1)

In [ ]:
del df_2017sum['광주지방경찰청']

In [ ]:
ch1516=(df_2016sum-df_2015sum)/df_2015sum*100
ch1516

In [ ]:
ch1617=(df_2017sum-df_2016sum)/df_2016sum*100
ch1617

In [ ]:
crime_data = pd.concat([df_2015sum,ch1516,df_2016sum,ch1617,df_2017sum],axis=1)
crime_data.columns = ['2015총계','2015~16증감율','2016총계','2016~17증감율','2017총계']

In [ ]:
df_2017sum